Menderin/Proyecto-desarrollo-e-innovacion/sdkconfig.defaults
# sdkconfig.defaults — Pórtico de Clasificación Magnética
# Target: ESP32 estándar (no S3, no C3)
CONFIG_IDF_TARGET="esp32"

# FreeRTOS: 1kHz tick para mayor resolución en vTaskDelay
CONFIG_FREERTOS_HZ=1000

# Log level por defecto: INFO
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Desactivar el watchdog del loop idle (evita resets en tareas largas)
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Stack mínimo para tareas de app
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
